app/Controllers/Home.php

    public function login()
    {
        if (session()->get('isLogged') === true) {
            return redirect()->to('/dashboard');
        }

        if ($this->request->getMethod() === 'POST') {
            // We keep 'username' here because your HTML <input> is named "username"
            $rules = [
                'username' => 'required|max_length[100]',
                'password' => 'required|max_length[255]',
            ];

            if (! $this->validate($rules)) {
                return redirect()->back()->withInput()->with('error', 'Enter both your email and password.');
            }

            $credentials = $this->request->getPost(['username', 'password']);

            // FIX: Query the 'email' column instead of 'username'
            $user = (new UserModel())->where('email', $credentials['username'])->first();
---
SELECT *
FROM `users`
WHERE `email` = 'plherrera@fit.edu.ph'
 LIMIT 1