app/Models/CustomerAccountModel.php

SELECT *
FROM `customer_accounts`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `customer_accounts`
---
    public function getAccountsPaginated($perPage) {
        return $this->paginate($perPage);

SELECT COUNT(*) AS `numrows`
FROM `customer_accounts`
---
    public function getTotalAccounts() {
        return $this->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `customer_accounts`
WHERE `status` = 'active'
---
    public function getCountByStatus($status) {
        return $this->where('status', $status)->countAllResults();